export const theme = Object.freeze({
  colors: {
    background: '#f5f5f5', // Основной фон сайта (светло-серебристый)
    backgroundSecondary: '#e0e0e0', // Второй фон сайта для хедера и футера (светлый серый)
    backgroundMenu: '#555555', // Цвет для открывающегося меню

    title: '#333333', // Цвет заголовков и текста (тёмно-серый)

    text: '#666666', // Основной цвет текста (серый)
    textSecondary: '#999999', // Второй цвет текста для выделения (средний серый)

    btn: '#4CAF50', // Цвет кнопок основной (зелёный)
    bthHover: '#66BB6A', // Цвет кнопок для hover и фокуса (светло-зелёный)

    accent: '#FFC107', // Цвет акцента для выделения (жёлтый)
  },
});

// ${p => p.theme.colors.btn}

// text: '#3f3f3f',
// accent: '#00c2e0',

// white: '#ffffff',
// gray: '#9e9e9e',
// light: '#f2f2f2',
// dark: '#212121',
